Revit 2026 API

# CircuitNamingSchemeIsValidCombinedParameters Method

---
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static bool IsValidCombinedParameters(
	Document aDocument,
	IList<TableCellCombinedParameterData> data
)
```
```vb
Public Shared Function IsValidCombinedParameters (
	aDocument As Document,
	data As IList(Of TableCellCombinedParameterData)
) As Boolean
```
```cpp
public:
static bool IsValidCombinedParameters(
	Document^ aDocument,
	IList<TableCellCombinedParameterData^>^ data
)
```
```fsharp
static member IsValidCombinedParameters :
        aDocument : Document *
        data : IList<TableCellCombinedParameterData> -> bool
```

#### Parameters

aDocument Document

data IListTableCellCombinedParameterData

#### Return Value

Boolean

#### Reference

CircuitNamingScheme Class

Autodesk.Revit.DB.Electrical Namespace